In [50]:
import pandas as pd

In [51]:
bronze=pd.read_csv("bronze.csv",index_col=0)
bronze.head()

          Country  NOC   Total
0   United States  USA  1052.0
1    Soviet Union  URS   584.0
2  United Kingdom  GBR   505.0
3          France  FRA   475.0
4         Germany  GER   454.0

In [52]:
silver=pd.read_csv("Silver.csv",index_col=0)
silver.head()

          Country  NOC   Total
0   United States  USA  1195.0
1    Soviet Union  URS   627.0
2  United Kingdom  GBR   591.0
3          France  FRA   461.0
4         Germany  GER   350.0

In [53]:
gold=pd.read_csv("Gold.csv",index_col=0)
gold.head()

          Country  NOC   Total
0   United States  USA  2088.0
1    Soviet Union  URS   838.0
2  United Kingdom  GBR   498.0
3          France  FRA   378.0
4         Germany  GER   407.0

In [54]:
filenames=["Gold.csv","Silver.csv","Bronze.csv"]

In [55]:
dataframes=[]

In [56]:
#filename="Gold.csv"
for filename in filenames:
    dataframes.append(pd.read_csv(filename,index_col=0))

In [57]:
medals=gold.copy()

In [58]:
new_labels=["NOC","Country","Gold"]

In [59]:
medals.columns=new_labels

In [60]:
medals.head()

              NOC Country    Gold
0   United States     USA  2088.0
1    Soviet Union     URS   838.0
2  United Kingdom     GBR   498.0
3          France     FRA   378.0
4         Germany     GER   407.0

In [61]:
medals["Silver"]=silver["Total"]

In [62]:
medals.head()

              NOC Country    Gold  Silver
0   United States     USA  2088.0  1195.0
1    Soviet Union     URS   838.0   627.0
2  United Kingdom     GBR   498.0   591.0
3          France     FRA   378.0   461.0
4         Germany     GER   407.0   350.0

In [63]:
medals["Bronze"]=bronze["Total"]

In [64]:
medals.head()

              NOC Country    Gold  Silver  Bronze
0   United States     USA  2088.0  1195.0  1052.0
1    Soviet Union     URS   838.0   627.0   584.0
2  United Kingdom     GBR   498.0   591.0   505.0
3          France     FRA   378.0   461.0   475.0
4         Germany     GER   407.0   350.0   454.0